package com.example.semi_project_kotlin

object OccupationList
{
    val occupationList = listOf<OccupationText>(
        OccupationText("시스템소프트웨어개발자", "컴퓨터시스템의 동작, 제어 및 관리와 관련된 시스템소프트웨어를 개발한다.",
        "수행직무: \n" +
                "1. 시스템소프트웨어개발자는 컴퓨터를 작동시키고 컴퓨터의 활동을 조정, 통제, 관리하는 오퍼레이팅시스템소프트웨어를 연구, 개발, 설계하는 일을 담당한다.\n" +
                "2. 시장조사와 경쟁업체의 제품 및 세계 소프트웨어업계의 기술변화 등을 분석하여 새로운 기능과 성능을 갖춘 시스템소프트웨어를 기획하고 개발한다.\n" +
                "3. 개발된 시스템소프트웨어를 컴퓨터에 설치, 시험 운영하여 시스템소프트웨어의 기능과 성능을 평가하고 분석한다.\n" +
                "4. 시스템소프트웨어의 사용자 교육과 기술자문을 지원하기도 하며, 새로운 시스템소프트웨어 관련 기술을 조사하고 연구한다.", "연봉: 3000만원 이상",
        "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
        "관련자격증: 전자계산기조직응용기사, 정보처리기능사"),

        OccupationText("응용소프트웨어엔지니어", "각종 응용분야의 컴퓨터소프트웨어를 설계하고 개발한다.",
            "수행직무: \n" +
                    "1. 응용소프트웨어의 개발범위와 목표를 설정한다. \n" +
                    "2. 소프트웨어를 개발·완성시키기 위한 전체적인 개발계획과 자원조달계획을 편성한다. \n" +
                    "3. 응용시스템에 대한 정보보호의 방법과 계획을 설정한다. \n" +
                    "4. 소프트웨어의 세부적인 기능 및 사양에 관한 상세설계를 한다. \n" +
                    "5. 상세설계에 따라서 단위프로그램을 개발하고, 개발된 여러 프로그램들을 모아서 응용시스템으로 결합시킨다. \n" +
                    "6. 해당 컴퓨터시스템에 설치하고 기능 및 성능을 종합적으로 평가·분석한다. 패키지성의 개발소프트웨어에 대해서는 체계적인 버전관리를 한다. \n" +
                    "7. 테스트를 통해 버그를 수정한다. \n" +
                    "8. 응용소프트웨어에 대한 사용자의 운영교육과 기술을 지원한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 전자계산기조직응용기사, SQLD, 정보처리기사, 디지털정보활용능력(DIAT)"),

        OccupationText("컴퓨터시스템감리전문가", "독립된 위치에서 정보시스템의 효율성 향상과 안전성 확보를 위하여 정보시스템의 구축 및 운영 등에 관한 사항을 종합적으로 점검하고, 문제점을 개선하도록 조언 및 권고한다.",
            "수행직무: \n" +
                    "1. 현행 정보기술의 아키텍쳐(architecture, 컴퓨터 시스템의 구성)를 파악하고, 시스템의 설계 원칙과 사양에 준거하여 정보시스템이 구축되었는지를 평가한다.\n" +
                    "2. 조직의 정보기술 및 비지니스 시스템이 적절히 통제, 점검, 평가되고 있는가를 감리 기준과 지침에 따라 평가한다.\n" +
                    "3. 정보시스템 부서의 관리, 계획, 조직과 관련된 제반 업무를 평가한다.\n" +
                    "4. 조직의 기술, 운영, 관리적 인프라 구축이 비즈니스 목표 달성에 부응하는가를 확인하기 위해 효율성을 평가한다.\n" +
                    "5. 조직의 정보보호 정책 및 업무를 평가함으로써 비인가 사용, 노출, 수정, 손실 또는 파손으로부터 정보 자산을 보호할 수 있는가를 평가한다.\n" +
                    "6. 유사시 비즈니스 활동과 정보시스템 처리를 지속적으로 수행할 수 있도록 문서보호, 전파방법, 모의 훈련 등이 실시되고 있는가를 평가한다.\n" +
                    "7. 비즈니스 응용 시스템의 개발, 획득, 설치 및 유지보수 활동을 위한 조직의 방법론과 절차를 평가함으로써 이들이 조직의 목표에 부응하는가를 확인한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 전자계산기조직응용기사, 정보관리기술사"),

        OccupationText("컴퓨터시스템설계분석가", "효율적인 정보시스템을 구축하기 위해 이용자의 요구사항과 사용 환경, 기술특성 등을 분석하고, 최신 기술을 이용하여 시스템을 설계,구축,사용까지의 모든 업무를 총괄한다.",
            "수행직무: \n" +
                    "1. 기업체, 대학교, 병원, 정부기관 등으로부터 시스템 구축 의뢰가 들어오면 새로운 시스템이 수행해야 할 기능과 특성, 데이터베이스 성격, 비용 등을 종합적으로 분석한다.\n" +
                    "2. 분석내용을 바탕으로 구축해야 할 하드웨어 및 소프트웨어, 소요기간 등을 산정하고 시스템 설계안을 기획한다.\n" +
                    "3. 시스템 설계 시 생산성을 극대화하기 위하여 고객의 요구사항을 체계적으로 반영하고, 컴퓨터프로그래머, 데이터베이스관리자, 컴퓨터보안전문가 등과 협의한다.\n" +
                    "4. 시스템 설계안에 제시된 기능이 제대로 구현되고, 일정에 맞춰 시스템 구축이 완료될 수 있도록 관리한다.\n" +
                    "5. 데이터베이스를 분석하고, 소프트웨어 튜닝을 실시하여 컴퓨터시스템의 환경을 최적화시킨다.\n" +
                    "6. 개발된 시스템이 안정적으로 운용되는지 시험하고 문제점이 발견되면 수정작업을 한다.\n" +
                    "7. 개발된 시스템을 운용하는 데 필요한 사용자 교육이나 기술평가를 하기도 한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 전자계산기기능사, 정보관리기술사"),

        OccupationText("네트워크프로그래머", "개별 사이트에 영향을 미치는 네트워크의 성능을 모니터링하고, 진단?컨트롤?측정하여 네트워크시스템을 계획 및 설계한다.",
            "수행직무: \n" +
                    "1. 다수의 사이트로 구성된 네트워크시스템의 설계와 구조를 분석한다. 분석된 문제점의 해결책을 설명하기 위해 네트워크 구성도, 소프트웨어 설계도를 작성한다.\n" +
                    "2. 다수의 네트워크 환경 내에서의 멀티미디어(음성, 데이터, 이미지)의 전송을 위한 경로와 전송 로직을 설계하기 위해 디지털 기호화 형식, 라인 코드, 타이밍 기술을 적용한다.\n" +
                    "3. 고객의 통신요구 사항에 대한 해결책을 정의하고 분석?제공하기 위해 사용자와 논의한다.\n" +
                    "4. 설계도구를 사용하여 계획된 네트워크의 활용을 평가하고 다수의 사이트 네트워크를 위한 매체, 기술, 비용 등의 해결책을 제시한다.\n" +
                    "5. 다수의 사이트 네트워크 프로젝트를 위해 Costing Model, 보고서, 기술적 해결책을 제공한다.\n" +
                    "6. 하위 직무수행자를 대상으로 담당 분야에 대한 기술적 교육을 실시하고 교육과정을 개발한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 보통 이상", "고용평등: 좋음",
            "관련자격증: 전자계산기조직응용기사, 정보관리기술사, 정보처리기능사"),

        OccupationText("네트워크시스템개발자", "사용자의 요구사항에 부합하는 네트워크시스템을 분석·설계·구축한다.",
            "1. 네트워크시스템개발자 전체적인 네트워크시스템의 구조를 분석하고 평가하여 문제점과 개선책을 도출한다.\n" +
                    "2. 사용자의 요구사항에 부합되는 기본적인 네트워크 시스템의 구조를 기능성, 안정성, 확장성, 변경가능성, 관리 용이성에 입각하여 설계한다.\n" +
                    "3. 구성요소에 대한 세부적 사양을 설정한다\n" +
                    "4. 네트워크 관련 시스템에 대한 조사·분석과 벤치마킹의 과정을 통해 활용 가능성을 평가한다.\n" +
                    "5. 평가 검증된 네트워크 시스템을 기초로 세부적으로 시스템을 설계한다.\n" +
                    "6. 시스템 구축 전에 네트워크 장비들에 대한 설치 위치, 환경, 케이블 등의 구비 요건을 확인·점검한다.\n" +
                    "7. 시스템이 도입되면 단위 시스템에 대한 인터페이스와 설치 과정을 통해 시스템의 기능과 성능을 평가한다.\n" +
                    "8. 단위 시스템의 평가가 완료되면 전체적으로 네트워크 시스템과 컴퓨터 시스템들을 통합 연동하여 종합적으로 평가하고 분석한다.\n" +
                    "9. 통합 구축된 네트워크 시스템의 시험 평가가 완료되면, 실제 운영에 대비한 네트워크 시스템의 운영 관리체계를 정립한다.\n" +
                    "10. 구축 완료된 네트워크 시스템에 대해서 일정 기간 실제 운영한 데이터를 분석·평가하여 시스템의 조정과정을 거쳐 기능과 성능을 향상시킨다.\n" +
                    "11. 네트워크의 고장이 발생하였을 경우 네트워크 관리자와 함께 원인을 파악하고, 복구를 위한 대책을 강구한다.\n" +
                    "12. 네트워크 시스템에 관한 보안 정책을 수립하고, 네트워크를 통한 해킹을 방지하기 위한 기술적 보안과 관리적 보안을 설계한다.\n" +
                    "13. 네트워크의 기술 동향 및 추세를 지속적으로 조사·분석하여 정보기술의 변화에 대비한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 전자계산기조직응용기사, 전자계산기기사, 정보처리기사, 빅데이터분석기사"),

        OccupationText("네트워크엔지니어", "사용자의 요구사항에 부합하는 네트워크시스템을 분석·설계·구축한다.",
            "수행직무: \n" +
                    "1. 네트워크엔지니어는 전산망과 관련된 각종 하드웨어 및 소프트웨어 등에 관한 네트워크시스템의 분석, 설계 및 구축에 관한 업무를 한다.\n" +
                    "2. 전체적인 네트워크 시스템의 구조를 분석하고 평가하여 문제점과 개선책을 마련하고 사용자의 요구사항과 기대에 부합될 수 있는 기본적인 네트워크 시스템에 대한 기능성, 안정성, 확장성, 변경가능성, 관리용이성에 입각하여 구조를 설계 한다.\n" +
                    "3. 구성요소에 대한 세부적 사양을 설정하고, 네트워크관련 시스템에 대한 조사분석과 벤치마킹의 과정을 통해 활용 가능성을 평가검증하며, 네트워크 고장 시 원인을 파악하여 신속한 복구대책을 강구한다.\n" +
                    "4. 상세 설계의 설계 시방서에 입각하여, 관련 하드웨어장비 및 네트워크 소프트웨어에 대한 조달 방안을 마련한다.\n" +
                    "5. 발주된 시스템이 입고되면, 단위 시스템에 대한 인터페이스와 설치 과정을 통해 시스템의 기능과 성능을 시험 확인하고 이의 결과를 평가한다.\n" +
                    "6. 단위 시스템의 시험이 완료되면 전체적으로 네트워크 시스템과 컴퓨터 시스템들을 통합 연동하여 종합적으로 시험 평가하고 분석한다.\n" +
                    "7. 통합 구축된 네트워크 시스템의 시험 평가가 완료되면, 실운영에 대비한 네트워크 시스템의 운영 관리체계를 정립한다.\n" +
                    "8. 네트워크 고장 시 네트워크 관리자와 더불어 원인파악을 하고, 신속한 복구대책을 강구한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: 전자계산기조직응용기사, 정보관리기술사, 정보처리기능사, 네트워크관리사2급"),

        OccupationText("네트워크관리자", "클라이언트, 서버, 인터넷 및 인트라넷 형태의 전산망 관련 하드웨어 및 소프트웨어 자원을 관리하고 운영한다.",
            "수행직무: \n" +
                    "1. 네트워크시스템에 대한 운영과 관리의 지침을 마련한다.\n" +
                    "2. 전체적인 네트워크시스템의 구성 상태를 파악하고, 실시간 시스템의 운영상태를 모니터링한다.\n" +
                    "3. 네트워크 케이블의 포설위치, 레이아웃, 배선상태 등에 관하여 상세하게 기록·관리하고, 네트워크 케이블의 확장 및 변경 시 수정·관리한다.\n" +
                    "4. 네트워크에 연결된 사용자의 PC, 서버컴퓨터, 주변기기 등에 대해서 주소체계를 설정 및 부여한다.\n" +
                    "5. 네트워크의 변경 및 확장 시 주소의 설정을 조정한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 전자계산기조직응용기사, 전자계산기기능사, 전자계산기기사, 정보관리기술사, 정보처리기능사, 정보처리기사, 정보처리산업기사"),

        OccupationText("네트워크설계자", "개별사이트에 영향을 미치는 네트워크의 성능을 모니터링하고 진단·컨트롤·측정하여 네트워크시스템을 계획 및 설계한다.",
            "수행직무: \n" +
                    "1. 다수의 사이트로 구성된 네트워크시스템의 설계와 구조를 분석한다. \n" +
                    "2. 분석된 문제점의 해결책을 설명하기 위해 네트워크 구성도, 소프트웨어 설계도를 작성한다. 3. 다수의 네트워크환경 내에서의 멀티미디어(음성, 데이터, 이미지)의 전송을 위한 경로와 전송로직을 설계하기 위해 디지털 기호화형식, 라인코드, 타이밍기술을 적용한다. \n" +
                    "4. 고객의 통신요구사항에 대한 해결책을 정의하고 분석·제공하기 위해 사용자와 논의한다. 설계도구를 사용하여 계획된 네트워크의 활용을 평가하고 다수의 사이트 네트워크를 위한 매체, 기술, 비용 등의 해결책을 제시한다.\n" +
                    "5. 다수의 사이트 네트워크 프로젝트를 위해 비용산출모델, 보고서, 기술적 해결책을 제공한다. \n" +
                    "6. 하위 직무수행자를 대상으로 담당분야에 대한 기술적 교육 실시 및 교육과정을 개발한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 정보처리기사, 전자계산기조직응용기사"),

        OccupationText("망관리기술연구원", "통신망을 상호연동시키고 총체적으로 관리하기 위하여 교환망, 전송망, 선로망 관리에 대한 연구를 수행하고, 지능망, 데이터통신망, 초고속정보통신망, 위성통신망, 무선통신망 등에 관련된 종합적인 망관리기술(Network Management)을 연구·개발한다.",
            "수행직무: \n" +
                    "1. 운용 중인 다양한 교환망의 종합관리기능과 타 망관리시스템과의 유기적 연동을 비롯한 종합적인 통신망관리체제(어떠한 상황에서도 통신망의 용량을 최대한 이용할 수 있도록 통신망의 성능을 감시하고, 필요에 따라 트래픽의 유입을 제어하는 조치를 취하는 기능)의 구축에 관해 연구·개발한다. 통신망관리 및 운용보전코드 표준화와 관련 시스템을 개발한다. \n" +
                    "2. 각종 전송망 및 시설운용관리를 위한 집중적인 관리감시 제어기술을 연구한다. \n" +
                    "3. 교환, 전송, 선로 관련 집중운용보전시스템을 개발한다. \n" +
                    "4. 데이터망 운용관리기술을 개발한다. \n" +
                    "5. 운용 관련 진단 및 운용효율화 방안, 시스템 간 연동 등에 관한 연구한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 정보통신기술사, 정보통신기사, 정보통신산업기사"),

        OccupationText("정보시스템운영자", "정보시스템운영자는 정보 시스템을 안정적으로 관리·운영하고, 시스템의 성능을 최적의 상태로 유지하기 위한 제반 업무를 수행하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 정보시스템의 관리와 운영에 대한 지침서를 작성한다.\n" +
                    "2. 컴퓨터시스템의 구성요소에 대한 유지, 보수 등 관리방안을 마련한다.\n" +
                    "3. 전산실의 온도, 습도 분진 등을 체크하여 적정 수준을 유지시켜 시스템장비를 보호한다.\n" +
                    "4. 정보시스템의 사용자를 등록, 관리하고 이들에 대하여 시스템 접근을 관리한다.\n" +
                    "5. 정보시스템의 자원을 보호하기 위한 관리적·기술적 보안 조치를 마련하고, 이를 관리·통제한다.\n" +
                    "6. 정보시스템의 안정적인 운영을 위하여 수시로 시스템의 성능 및 기능을 점검하고, 문제를 해결한다.\n" +
                    "7. 시스템에서 운영되고 있는 실제 데이터를 정기적으로 백업한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 전자계산기기능사, 정보처리기사, 전자계산기제어산업기사, 리눅스마스터 1급, 네트워크관리사2급"),

        OccupationText("정보통신관리자", "정보통신관리자는 정보통신 또는 전산 부서의 종사자들을 지휘·감독하고, 새로운 프로그램 운영체제를 도입하기 위해 계획수립 및 전산장비 구축하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 지역 범위내의 통신교통량과 흐름을 지휘하고 관리하며, 통신설치, 운영 및 관리 서비스를 분석하고 평가하며 개선안을 낸다.\n" +
                    "2. 우편기관의 활동 및 운영을 기획, 조직, 지시하며 관리한다.\n" +
                    "3. 정보시스템 및 전산운영 부서와 사업체의 운영을 기획, 지시한다.\n" +
                    "4. 전자 자료처리와 컴퓨터시스템 운영 및 개발을 위한 기준을 수립하고 작업을 평가한다.\n" +
                    "5. 자료처리, 시스템 요건 및 명세사항을 사용자와 협의한다.\n" +
                    "6. 인력 채용, 훈련 및 업무수행을 감독한다.", "연봉: 5000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 정보통신기술사, 정보통신기사, 정보처리기사, 정보처리기능사"),

        OccupationText("정보통신컨설턴트", "정보통신컨설턴트는 기업의 요구사항에 적합한 전산시스템을 구축할 수 있도록 시스템 사양이나 예산, 구축 기간 등에 대한 기술적 컨설팅하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 고객의 시스템 요구사항에 대한 문서를 검토한다.\n" +
                    "2. 고객이 가지고 있는 시스템에 대한 문제점을 분석하여 문서를 작성한다.\n" +
                    "3. 새로운 시스템 도입 후 나타나게 될 효율성에 대한 문서를 작성한다.\n" +
                    "4. 작성된 문서를 바탕으로 의뢰자와 협의하여 시스템 구축에 필요한 예산 및 기간 등의 계획을 수립한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 전자계산기기능사, 정보처리기능사, 전자계산기기사, 컴퓨터시스템응용기술사, 정보처리기사, 전자계산기제어산업기사"),

        OccupationText("통신공학 기술자 및 연구원", "통신공학 기술자 및 연구원은 물리학, 수학 및 컴퓨터의 구조와 원리에 대한 전문 지식을 바탕으로 통신 장비의 설계, 생산 업무를 관리감독하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 통신공학 기술자 및 연구원은 물리학, 수학 및 컴퓨터의 구조와 원리에 대한 전문 지식을 바탕으로 통신 장비의 설계, 생산 업무를 관리감독한다.\n" +
                    "2. 종합적인 통신망 체계를 구축하기 위해 망을 기획,연구하고 설계하며, 세부적인 시설에 대한 계획을 수립한다.\n" +
                    "3. 전화기, 교환기, 전송기, 단말기, 송수신기 등 각종 통신장비를 연구,개발, 설계하고, 이들의 설치, 유지, 보수 활동을 계획, 감독한다.\n" +
                    "4. 단파방송 서비스 현황 및 수신상태를 분석하고 주파수를 선별하며 송출시스템 송신장비 운용사항을 검토하고, 방송시설을 설계한다.\n" +
                    "5. 무선통신에 관한 공학기초지식을 바탕으로 이동전화, PCS, 레이다설비, 방향탐지기, 팩시밀리, 공동시청안테나, 무선LAN 등의 각종 무선설비 설계 및 설치공사를 감독, 시공하는 기술적인 업무를 수행한다.\n" +
                    "6. 위성통신 연구설계, 제작 및 관련 기간산업시설, 각종 생활편리성 등을 연구 개발한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 보통 미만",
            "관련자격증: 정보통신산업기사, 정보통신기사, 전파전자통신기능사, 방송통신산업기사"),

        OccupationText("통신장비기사", "통신장비기사는 무선중계기시스템이나 유선통신장비, 무선통신장비, 위성통신망 등의 장비를 관리하고 운용하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 통신장비기사는 무선중계기시스템, 유선통신장비, 무선통신장비, 위성통신장비 등 의 장비를 유지하고 관리하며 운용한다.\n" +
                    "2. 설치접수증을 확인하여 설치할 장소와 통신장비의 종류를 확인한다.\n" +
                    "3. 설계도면을 검토하여 통신선로를 분리하고 수동공구, 전기인두 등을 사용하여 전화기, 팩시밀리 등에 연결한다.\n" +
                    "4. 설치가 완료되면 선로시험원에게 연락하여 선로의 장애유무를 확인한다.\n" +
                    "5. 각종 측정장비를 사용하여 구내의 통신선로를 점검하기도 하며 파손된 장비를 수리하기도 한다.", "연봉: 3000만원 이상",
            "일자리전망: 보통 미만", "발전가능성: 보통 미만", "고용평등: 보통 미만",
            "관련자격증: 통신설비기능장, 정보통신기술사"),

        OccupationText("통신, 방송 및 인터넷케이블설치 및 수리원", "전화선, 광케이블 등 통신망에 기초가 되는 통신선을 설치 및 수리한다.",
            "수행직무: \n" +
                    "1. [전용회선서비스개통원] 고객에게 전용회선 서비스를 개통해 주기 위해 케이블 접속, 통신장비 설치, 통신환경 구성의 업무를 수행한다.\n" +
                    "2. [주배선반원] 전화가 원활히 소통되도록 주배선반을 유지관리한다.\n" +
                    "3. [초고속통신망설치원] 고객의 PC사양에 맞추어 초고속통신모뎀을 설치하고, 필요에 따라 소프트웨어를 설치한다.\n" +
                    "4. [케이블방송단말기설치원] 케이블방송 가입자 단말기를 설치, 철거한다.\n" +
                    "5. [케이블접속원] 포설 또는 가선된 전기 및 통신용 단심케이블, 다심케이블 및 광케이블을 접속·시험하고 케이블 부속장비를 설치한다.\n" +
                    "6. [통신선로가설원] 전화국간의 중계선로나 수용가까지 통신선로를 가설한다.", "연봉: 3000만원 이상",
            "일자리전망: 보통 미만", "발전가능성: 보통 미만", "고용평등: 보통 미만",
            "관련자격증: 방송통신기능사, 정보통신산업기사, 전파전자통신기사, 무선설비기능사, 통신선로산업기사, 통신설비기능장"),

        OccupationText("        데이터베이스      ", "", "", "", "",
            "", "", ""),

        OccupationText("데이터베이스개발자", "데이터베이스를 설계하고, 최적화를 위한 관리 업무를 수행한다.",
            "수행직무: \n" +
                    "1. 데이터베이스(DB: Data Base) 구축에 앞서 업무를 파악한다.\n" +
                    "2. 데이터의 물리구조를 설계한다.\n" +
                    "3. 온라인 업무를 위한 라인을 설계한다.\n" +
                    "4. 데이터베이스의 크기를 산정하고 최적화 배치를 한다.\n" +
                    "5. 온라인 가동 환경을 구축한다.\n" +
                    "6. 데이터베이스의 어플리케이션을 변경관리를 한다.\n" +
                    "7. 구축된 데이터베이스 및 온라인 성능의 추이를 분석하고 소프트웨어를 변경하거나 버전을 변경하여 튜닝을 한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: OCP, OCPJP"),

        OccupationText("데이터베이스관리자", "컴퓨터를 사용하여 각종 데이터를 체계적으로 수집, 정리, 가공 및 입력하여 데이터베이스를 구축, 관리, 분석하는 일을 한다.",
            "수행직무: \n" +
                    "1. 데이터베이스관리자는 컴퓨터를 사용하여 각종 데이터를 체계적으로 수집, 정리, 가공 및 입력하여 데이터베이스를 구축, 관리, 분석하는 일을 한다.\n" +
                    "2. 데이터베이스를 분석하고, 사용자에 대한 등록 및 데이터의 접근 범위, 읽고 쓰기 권한, 사용자의 로그인 및 암호 관리를 한다.\n" +
                    "3. 데이터베이스 시스템의 고장이나 사용상의 문제가 발생하면 신속히 원인을 파악하여 조속히 복구하는 일을 하거나, 사용자에 대한 사용 교육과 기술을 지원한다.\n" +
                    "4. 데이터베이스를 주기적으로 백업하여 데이터의 손실을 예방한다.\n" +
                    "5. 고객이 요구하는 특정분야의 자료를 일정기간동안 수집하여 정리하고, 입력된 자료를 검토하여 문제점을 보완한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: 전자계산기기능사, 정보처리기능사, 컴퓨터시스템응용기술사, 정보기술프로젝트관리전문가"),

        OccupationText("빅데이터분석가", "사람들의 행동 패턴 또는 시장의 경제상황 등을 예측하며 데이터 속에 함축된 트렌드나 인사이트를 도출하고 이로부터 새로운 부가가치를 창출하기 위해 대량의 빅데이터를 관리하고 분석한다.",
            "수행직무: \n" +
                    "1. 빅데이터분석가는 분석목표에 따라 빅데이터의 분석방법을 기획한다.\n" +
                    "분석할 빅데이터 자원을 수집한다.\n" +
                    "2. 대용량의 데이터를 처리하는 플랫폼을 활용하여 데이터를 처리하고 분석한다.\n" +
                    "3. 분석방법에 따라 마이닝(데이터 마이닝, 텍스트 마이닝, 오피니언 마이닝), 계량정보 분석(계량서지학, 계량정보학, 웹계량화), 네트워크 분석(사회 네트워크 분석, 지식 네트워크 분석, 언어 네트워크 분석), 복잡계기법 분석(복잡계 네트워크 분석, 행위자 기반 모형, 시스템 다이나믹스), 클러스터 분석(비슷한 특성을 가진 개채를 합해서 유사그룹을 발굴) 등을 활용한다.\n" +
                    "4. 프로그램을 사용하여 분석결과를 시각화한다.\n" +
                    "5. 실시간으로 데이터를 수집·저장·분석하고 시각화하여 의미 있는 분석결과를 도출하기도 한다.\n" +
                    "6. 빅데이터와 관련된 새로운 기술, 유행, 트렌드 등을 수시로 파악한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: 빅데이터분석기사"),

        OccupationText("빅데이터전문가", "행동 패턴 또는 시장의 경제상황 등을 예측 및 트렌드나 인사이트를 도출후 새로운 부가가치를 창출하기 위해 대량의 빅데이터를 관리하고 분석한다.",
            "수행직무: \n" +
                    "1. 분석목표에 따라 빅데이터의 분석방법을 기획한다.\n" +
                    "2. 분석할 빅데이터 자원을 수집한다.\n" +
                    "3. 대용량의 데이터를 처리하는 플랫폼을 활용하여 데이터를 처리하고 분석한다.\n" +
                    "4. 프로그램을 사용하여 분석결과를 시각화한다.\n" +
                    "5. 실시간으로 데이터를 수집·저장·분석하고 시각화하여 의미 있는 분석결과를 도출하기도 한다.\n" +
                    "6. 빅데이터와 관련된 새로운 기술, 유행, 트렌드 등을 수시로 파악한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 보통 이상", "고용평등: 보통 이상",
            "관련자격증: 빅데이터분석기사"),

        OccupationText("웹프로듀서", "웹프로듀서는 웹사이트를 만들기 위한 기획, 내용구성, 디자인 등 홈페이지를 관리하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 웹프로듀서는 웹사이트 기획, 구축 및 운영, 마케팅 등을 총괄한다.\n" +
                    "2. 새로운 인터넷 사이트를 만들기 위한 기획안을 만들며, 웹사이트에서 제공할 내용, 디자인 등 전반적인 홈페이지 관리를 담당한다.\n" +
                    "3. 지속적으로 웹사이트의 자료를 갱신한다.\n" +
                    "4. 웹사이트 구축을 위해 웹엔지니어, 웹디자이너, 웹프로그래머 등과 업무를 협의한다.\n" +
                    "5. 사용자의 성향과 접속 현황 등을 분석하여 웹사이트의 내용을 수정, 보완하여 개편하며, 사용자의 불만사항을 처리한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: 웹디자인기능사, 시각디자인기사"),

        OccupationText("웹개발자", "웹상에서 각종 자료들을 보여줄 수 있도록 웹 프로그래밍 언어를 이용하여 프로그램을 설계하고 작성한다.",
            "수행직무: \n" +
                    "1. 웹 개발자는 웹상에 올릴 자료의 성격과 형태에 대한 요구를 파악하고 분석한다.\n" +
                    "2. 프로그래밍언어(Php, Asp, Java, Jsp 등)를 이용하여 프로그램을 코딩한다.\n" +
                    "3. 웹상에서 테스트한 후 문제점을 확인하고 수정한다.\n" +
                    "4. 기존에 개발된 프로그램을 유지 및 보수한다.\n" +
                    "5. 웹디자이너와 업무를 협의한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("웹기획자", "웹서비스 내용에 대한 기획, 웹사이트 구축 및 관리를 위한 기술적 검토, 웹페이지 운영 및 서비스 활성화 마련 등의 업무를 수행한다.",
            "수행직무: \n" +
                    "1. 웹사이트에서 제공할 구성 내용을 기획한다.\n" +
                    "2. 웹사이트의 구축을 위해 웹 엔지니어, 웹 디자이너, 웹 프로그래머 등과 업무를 협의한다.\n" +
                    "웹사이트의 자료를 갱신한다.\n" +
                    "3. 웹사이트의 게시판과 전자우편을 통한 사용자의 요구와 불만 사항을 신속히 처리한다.\n" +
                    "4. 사용자의 성향과 접속 현황 등을 분석하여 웹사이트의 내용을 수정·보완하여 개편한다.\n" +
                    "5. 웹사이트의 구축을 외부업체에 맡겼을 때, 외부업체 개발자들과의 긴밀한 의사소통을 통해 사이트 구축 목적이 정확하게 구현될 수 있도록 지속적으로 작업 과정과 결과물을 확인한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: OCP, OCPJP, 정보처리기사, 정보처리기능사, 정보처리기능사, 정보처리산업기사"),

        OccupationText("웹프로듀서", "웹프로듀서는 웹사이트를 만들기 위한 기획, 내용구성, 디자인 등 홈페이지를 관리하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 웹프로듀서는 웹사이트 기획, 구축 및 운영, 마케팅 등을 총괄한다.\n" +
                    "2. 새로운 인터넷 사이트를 만들기 위한 기획안을 만들며, 웹사이트에서 제공할 내용, 디자인 등 전반적인 홈페이지 관리를 담당한다.\n" +
                    "3. 지속적으로 웹사이트의 자료를 갱신한다.\n" +
                    "4. 웹사이트 구축을 위해 웹엔지니어, 웹디자이너, 웹프로그래머 등과 업무를 협의한다.\n" +
                    "5. 사용자의 성향과 접속 현황 등을 분석하여 웹사이트의 내용을 수정, 보완하여 개편하며, 사용자의 불만사항을 처리한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: 웹디자인기능사, 시각디자인기사"),

        OccupationText("컴퓨터보안전문가", "컴퓨터보안전문가는 지식정보화사회의 중요한 정보시스템과 정보자산을 보호하기 위해 보안정책을 수립하고, 시스템에 대한 접근 및 운영을 통제하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 조직의 정보보호 정책, 표준, 기본방침, 절차, 모니터링 방법 등을 분석하여 정보보호 관련 환경수준을 평가한다.\n" +
                    "2. 네트워크의 위험하고 취약한 요소를 파악하여 대비책을 마련한다.\n" +
                    "3. 인트라넷, 엑스트라넷, 업무 관련 솔루션 및 제휴업체를 연결하는 정보보호 아키텍쳐를 구현한다.\n" +
                    "4. 조직의 정보보호 수준을 최상으로 유지하기 위해 정기적으로 정보보호 수준을 평가하고, 새롭게 대두되는 정보보호 방식을 채택한다.\n" +
                    "5. 인터넷망을 통한 외부로부터의 불법적인 침입을 차단하기 위해 방화벽을 구축한다.\n" +
                    "6. 외부로부터의 불법적인 침입을 탐지하기 위한 시스템을 개발한다.\n" +
                    "7. 컴퓨터 시스템에 대한 접근 권한을 부여한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 정보보안기사, 정보시스템감리사, 컴퓨터시스템응용기술사, 정보처리기사"),

        OccupationText("정보보호전문가", "정보 보안 정책을 수립하고, 시스템에 대한 접근 및 운영을 통제하며, 침입자가 발생했을 때에는 신속히 탐지대응해 정보자산을 보호한다.",
            "수행직무: \n" +
                    "1. 정보보호전문가는 정보 보안 정책을 수립하고, 시스템에 대한 접근 및 운영을 통제하며, 침입자가 발생했을 때에는 신속히 탐지대응해 정보자산을 보호한다.\n" +
                    "2. 인가받지 않은 사람이 컴퓨터 시스템의 정보자원에 불법 접근하여 정보를 탈취, 변조, 파괴하는 등의 공격 행위를 할 때, 이를 방어하거나 예방한다.\n" +
                    "3. 각종 컴퓨터 바이러스의 발생과 해커의 침입에 대비하여 보안 정책을 수립하고, 방화벽(firewall)을 구축하며, 정보가 크래킹 당했을 때 이를 신속하게 복구하고 새로운 보안 체계를 구축한다.\n" +
                    "4. 위험하고 취약한 요소를 파악하여 대비책을 마련하고, 컴퓨터 바이러스 백신 프로그램을 개발하여 보급하며, 컴퓨터 바이러스에 감염된 데이터를 복구한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 보통 이상",
            "관련자격증: 전자계산기조직응용기사, 정보처리기능사"),

        OccupationText("정보보안전문가", "정보시스템과 정보자산을 보호하기 위해 보안정책을 수립하고, 시스템에 대한 접근 및 운영을 통제하며, 침입 발생시 신속히 탐지하여 즉각적으로 대응·복구한다.",
            "수행직무: \n" +
                    "1. 정보보안전문가는 조직의 정보보호 정책, 표준, 기본방침, 절차, 모니터링 방법 등을 분석하여 정보보호 관련 환경수준을 평가한다.\n" +
                    "2. 네트워크의 위험하고 취약한 요소를 파악하여 대비책을 마련한다.\n" +
                    "인트라넷, 엑스트라넷, 업무 관련 솔루션 및 제휴업체를 연결하는 정보보호 아키텍쳐를 구현한다.\n" +
                    "3. 조직의 정보보호 수준을 최상으로 유지하기 위해 정기적으로 정보보호 수준을 평가하고, 새롭게 대두되는 정보보호 방식을 채택한다.\n" +
                    "4. 인터넷망을 통한 외부로부터의 불법적인 침입을 차단하기 위해 방화벽을 구축한다.\n" +
                    "5. 외부로부터의 불법적인 침입을 탐지하기 위한 시스템을 개발한다.\n" +
                    "6. 컴퓨터 시스템에 대한 접근 권한을 부여한다.\n" +
                    "7. 컴퓨터 바이러스 백신 프로그램을 개발·보급한다.\n" +
                    "8. 컴퓨터 바이러스에 감염된 데이터를 복구한다.\n" +
                    "9. 정보보호 관련 소프트웨어 제품을 기획한다.\n" +
                    "10. 정보보호 업무 전반에 대하여 최고 경영자 및 업무관리자에게 보고하고, 이들을 대상으로 교육한다.\n" +
                    "11. 정보보호제도 입안 과정에 참여하여 기술 규격 및 표준화 제정에 협력한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 정보보안기사"),

        OccupationText("게임QA전문가", "사용자의 게임플레이로 얻을 수 있는 만족도를 최대화할 수 있도록 제작 중이거나 완성한 게임을 분석하여 게임기획 내용을 적절하게 반영할 수 있도록 제안하고 수정한다.",
            "수행직무: \n" +
                    "1. 제작 중이거나 완성한 게임을 플레이하고 분석하여 게임의 시스템, 레벨 등의 콘텐츠가 적절하게 구성되었는지를 파악한다.\n" +
                    "2. 게임기획 내용을 바탕으로 시스템에 발생할 수 있는 문제점을 파악하고 목록화한다.\n" +
                    "3. 목록화한 문제점을 점검하여 실제문제가 발생했는지를 확인하고 보고하며, 개선점을 제시한다.\n" +
                    "4. 기획내용을 바탕으로 레벨디자인, 밸런스디자인에서의 방향성을 이해하고, 테스트를 위한 계획을 작성하여 실제 테스트를 진행한다.\n" +
                    "5. 레벨, 밸런스디자인의 문제점을 이해하고 개선사항을 정리하여 제작팀에 전달한다.\n" +
                    "6. 작성된 게임의 로그데이터의 내용을 이해하고, 구체적인 문제점을 파악하여 게임개발에 반영한다.\n" +
                    "7. 수정된 내용을 확인하여 적절하게 수정되고 적용되었는지 파악한다.", "연봉: ",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: "),

        OccupationText("게임그래픽프로그래머", "게임기획을 바탕으로 게임에 사용하는 시각적인 표현을 더욱 원활하게 할 수 있도록 프로그래밍한다.",
            "수행직무: \n" +
                    "1. 게임기획과 개발환경을 고려하여 적절한 그래픽적인 효과를 적용할 수 있는 프로그래밍 방향성을 정리한다. \n" +
                    "2. 담당자들과 협의를 통해 그래픽 구현에 필요한 각종 툴과 스크립트의 목록을 작성하고 작업스케줄을 구성한다. \n" +
                    "3. 게임의 방향성에 적합한 셰이더효과를 위하여 각종 셰이더기능을 이용하여 변환, 렌더링 등의 작업을 처리할 수 있도록 프로그램을 구성하며, 조명모델을 활용하여 음영을 현실적으로 구현한다.\n" +
                    "4. 이펙트기능의 효과적인 구현을 위하여 셰이더언어를 사용하여 코드를 작성하고 적용한다. 5. 물리기반 렌더링으로 영상의 질을 향상시킨다.\n" +
                    "6. 영상을 후처리할 수 있도록 각종 필터를 코딩하고 적용한다.\n" +
                    "7. 구현한 셰이터툴과 스크립트를 적용하고 개량한다.", "연봉: ",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("게임기획자", "컴퓨터 게임의 아이템과 스토리, 캐릭터 등을 구성 및 기획하고 제작 과정을 관리한다.",
            "수행직무:\n" +
                    "1. 게임기획자는 PC 게임, 네트워크 게임 등 게임용 소프트웨어 제작과 관련된 모든 사항들을 총괄적으로 지휘하고 감독하는 일을 담당한다.\n" +
                    "2. 게임 시장 조사 등을 통해 소비자들이 좋아하고 원하는 게임이 무엇인지를 파악하고, 새로운 게임 제작을 위한 아이디어를 구상하여 이에 대한 기획안을 작성한다.\n" +
                    "3. 게임의 장르와 대상 연령층, 게임 난이도, 게임의 각종 캐릭터의 역할 및 특징, 기본적인 스토리 전개 등을 설정하고, 그래픽 디자이너, 프로그래머 등과 함께 본격적으로 게임 프로그램을 제작한다.\n" +
                    "4. 게임소프트웨어에 대한 베타테스트를 하고 시연회에 참여하는 등 홍보 업무를 하기도 한다.\n" +
                    "5. 대사를 작성하는 등 세부적인 게임 시나리오를 작성하고, 기획의도를 이해하기 쉽게 그래픽디자이너나 프로그래머 등에게 전달한다.\n" +
                    "6. 게임이 제작되어 상품화가 되었을 때 시장진입이나 판매고의 수익을 올릴 수 있을 지를 판단,결정한다.\n" +
                    "7. 게임의 제작이 완료되면, 게임의 홍보와 마케팅 전략, 배급 등에 대한 계획을 수립하고 실행한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 매우 좋음",
            "관련자격증: X"),

        OccupationText("게임레벨디자이너", "사용자가 게임플레이를 통해서 핵심욕구를 적절히 충족할 수 있도록 기획목표에 따라 게임의 레벨구조를 분석하고, 레벨의 내용과 요소를 설계하며, 게임밸런스를 기획한다.",
            "수행직무: \n" +
                    "1. 레벨디자인의 개발에 참고할 수 있도록, 관련된 게임이나 제작 중인 게임의 플레이를 통해서 레벨과 밸런스를 전체적으로 파악하고, 이를 바탕으로 플로우구조를 구성하고, 밸런스수치를 정리하여 해당 레벨기획의 장점과 단점을 분석하여 분석기획서를 작성한다.\n" +
                    "2. 게임목표와 방향성을 바탕으로 게임을 진행하는 무대가 되는 여러 레벨을 기획한다. 개발자들과의 협의를 통해서 레벨디자인목표를 설정하고 이를 바탕으로 적합한 넓이, 진행시간, 진행요소를 갖춘 레벨을 디자인한다.\n" +
                    "3. 디자인한 레벨에 각 레벨요소를 적절하게 배치하고, 이를 테스트하기 위한 가이드문서를 작성한다. 시스템디자인을 바탕으로 게임밸런스 구성에 필요한 요소의 상관관계를 이해하고 밸런스조정목표를 기획하여, 밸런스 구축을 위한 방향성을 결정하고 이를 테스트할 수 있는 시뮬레이터를 구성한다.\n" +
                    "4. 시뮬레이터를 바탕으로 경험치곡선 같은 파라미터의 편동관계를 이해하고 적절한 수치와 함수를 적용한다. 레벨디자인, 밸런스디자인의 목표를 달성하기 위하여 AI패턴과 구조를 기획하고 그에 따른 스테이지의 설계를 진행한다.\n" +
                    "5. 제작한 게임의 레벨과 밸런스의 테스트를 통해서 세부적인 레벨, 밸런스디자인을 완성한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("게임서버프로그래머", "게임서버 컴퓨터에서 게임이 원활하게 운영되도록 게임서버시스템을 설계하고 네트워크프로그램 및 서버응용프로그램을 구현한다.",
            "수행직무: \n" +
                    "1. 게임기획을 바탕으로 유무선네트워크로 연동하는 게임의 서버시스템을 구상하고 서버시스템 구현에 필요한 정보를 수집·분석한다.\n" +
                    "2. 분석한 내용에 따라 서버시스템 구조를 설계한다.\n" +
                    "3. TCP/IP, UDP통신 등 데이터통신을 통해 프로세스 간 네트워크통신을 구현한다.\n" +
                    "4. 서버와 DB, 서버와 클라이언트 간의 데이터 전송구조를 설계하고 알고리즘을 작성한다.\n" +
                    "5. 작성한 알고리즘에 따라 게임서버리포팅 및 패치프로그램을 작성한다.\n" +
                    "6. 게임서버 테스트환경을 구축하고 테스트를 실시한다.\n" +
                    "7. 테스트 결과를 분석하여 튜닝하고 최종 서버응용 프로그램코드를 완성하여 게임서버 응용프로그램을 구현한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 게임프로그래밍전문가, 정보보안산업기사, 정보보안기사, 정보처리기사, 스마트폰개발자"),

        OccupationText("게임운영자", "게임을 모니터링하면서 이용자 간의 분쟁시비를 가려주고 이용자들의 고충과 불만사항을 접수해 개발진에게 전달한다.",
            "수행직무: \n" +
                    "1. 게임과 관련한 고객의 요구사항을 접수하고 해결한다.\n" +
                    "2. 유저들의 게임을 분석하며 매출을 예상한다.\n" +
                    "3. 방학이나 특정일을 따져 오픈베타의 적정시기를 제안한다.\n" +
                    "4. 고객의 불편사항을 바탕으로 수정이 필요한 사항을 관련 부서에 전달한다.\n" +
                    "5. 유저들의 게임을 보면서 게임의 특성을 찾아내고 홍보전략에 대한 의견을 제시한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 보통 이상", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("게임월드빌더", "기획내용을 바탕으로 사용자의 게임플레이에 필요한 레벨디자인 구조를 예술적인 형태로 재구성하고 꾸민다.",
            "수행직무: \n" +
                    "1. 게임의 방향성과 레벨디자인작업을 바탕으로 배경, 월드제작에 필요한 작업내용을 산출한다. \n" +
                    "2. 게임의 개발환경, 게임의 카메라 구성과 화면 구조와 같은 기술적인 사항을 고려하여 게임분위기에 어울리는 라이팅과 각종 효과를 기획한다.\n" +
                    "3. 게임에 필요한 타일과 텍스처, 오브젝트, 각종 프랍을 설계하여 제작한다.\n" +
                    "4. 게임레벨디자인 구조와 콘셉트디자인을 바탕으로 게임의 지도와 월드의 기본 방향성을 결정한다.\n" +
                    "5. 사용자의 시점과 플레이내용을 고려하여 월드디자인을 구성하고 배경그래픽요소를 배치하며, 라이팅과 각종 효과를 적용한다.\n" +
                    "6. 적용한 월드디자인을 분석하고 개량한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("게임프로그래머", "게임프로그램의 구조를 설계하고 게임프로그래밍을 수행한다.",
            "수행직무: \n" +
                    "1. 게임프로그래머는 게임기획자, 게임그래픽디자이너, 게임 음악가 등으로부터 넘겨받을 자료를 기반으로 게임프로그램의 구조를 설계한다.\n" +
                    "2. 게임을 제작하기 위한 툴인 게임엔진을 개발한다.\n" +
                    "영상을 컴퓨터 모니터에 출력하는데 필요한 제반 함수들의 집단인 그래픽 라이브러리를 제작한다.\n" +
                    "3. 그래픽 특수효과를 제작한다.\n" +
                    "4. 키보드, 마우스 등의 입력장치 제어루틴을 제작한다.\n" +
                    "5. 그래픽 파일이나 사운드 파일이 정상적으로 게임 속에서 작동될 수 있도록 해 주는 프로그램을 작성한다.\n" +
                    "6. 게임을 테스트하여 에러를 수정하고 버그를 찾아낸다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 매우 좋음",
            "관련자격증: X"),

        OccupationText("3D지도개발자", "도로 조사로 얻어진 자료를 데이터베이스에 입력하고 품질관리를 한 후 3D지도 데이터베이스를 배포한다.",
            "수행직무: \n" +
                    "1. 실측된 모든 자료를 데이터베이스에 입력한다.\n" +
                    "2. 객체를 추출하고 추출된 객체를 토대로 3D로 입체화한다. 내비게이션 업데이트 계획에 따라 3D지도 데이터베이스를 배포한다.\n" +
                    "3. 개발된 지도의 품질관리를 수행한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 보통 이상", "고용평등: 보통 이상",
            "관련자격증: X"),

        OccupationText("가상현실전문가", "가상현실전문가는 3차원모델링(3D) 및 가상현실모델링언어(VRML)등의 기술을 이용해 가상의 시공간을 개발하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 가상현실전문가는 3차원모델링(3D) 및 가상현실모델링언어(VRML)등의 기술을 이용해 가상의 시공간에서 가상시스템을 개발한다.\n" +
                    "2. 사용자가 원하는 가상세계가 무엇인지 파악하거나 개발하고자 하는 시스템을 분석하여 개발방향을 설정한다.\n" +
                    "3. 신제품에 대한 기획안을 토대로 3차원 컴퓨터그래픽 제어기술을 활용하여 프로그래밍 한 후 디자인 감각을 가지고 사용자가 실제의 느낌을 가질 수 있도록 가상현실시스템을 디자인한다.\n" +
                    "4. 제작된 3차원 가상현실 소프트웨어에 오류는 없는지 테스트하고 수정작업을 거쳐 제품을 완성하며 3차원 컴퓨터 그래픽 제어기술을 활용하여 프로그래밍 한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 시각디자인기사, 시각디자인산업기사, 컴퓨터그래픽스운용기능사, 로봇소프트웨어개발기사"),

        OccupationText("데이터시각화전문가", "데이터 분석결과를 효과적으로 그리고 이해하기 쉽게 전달하도록 핵심요소를 타이포그래피, 그리드, 색상 등 시각적으로 표현한다.",
            "수행직무: \n" +
                    "1. 다양한 형태의 데이터와 분석결과를 시각화하기 위하여 표현규칙, 사용자관점의 시각화 요건을 정의한다.\n" +
                    "2. 시각화 요건에 따른 사용자시나리오를 작성하고 핵심요소 및 그래픽요소를 이용하여 스토리보드를 기획한다.\n" +
                    "3. 기획된 스토리보드에 따라 시각화를 구현하기 위한 도구와 기술을 선택하고 정보시각화를 위한 접근방법을 결정한다.\n" +
                    "4. 분석의 핵심내용을 단순하고 명확하게 전달할 수 있도록 구조적으로 시각화한다.\n" +
                    "5. 추가정보를 이용하여 시각화한 그래프를 보정하고 시각표현을 극대화하여 품질을 높이기 위해 타이포그래피, 그리드, 색상, 아이소타이프 등 그래픽디자인을 적용한다.\n" +
                    "6. 정보사용자의 행동이나 조작에 따른 반응, 정보시각화의 변화 등으로 정보와 정보사용자 간의 관계확장을 위해 사용자 참여를 유도하는 인터렉션 기능을 구현한다.\n" +
                    "7. 최종 디자인된 시각화결과물이 시각적으로 적절하게 구현되었는지 확인한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 경영빅데이터분석사, ADP"),

        OccupationText("디지털영상처리시스템개발자", "컴퓨터를 이용한 영상분석, 영상인식, 영상복원 및 영상통신 등에 관련된 시스템을 개발한다.",
            "수행직무: \n" +
                    "1. 디지털영상에 관한 신기술동향을 파악하고 연구한다.\n" +
                    "2. 카메라, 스캐너, 인터넷 등에서 디지털이미지를 획득한다.\n" +
                    "3. 여러가지로 분리되어 있는 영상을 목적에 맞게 개선하는 영상조작, 글자, 그림, 영상 등을 분석하는 영상분석, 물체를 모습 그대로 인식하는 영상인식, 손상된 영상을 복구하는 영상복원, 영상을 저장하거나 압축하여 위성이나 케이블, 네트워크 등으로 전송하는 영상통신에 관련된 시스템을 개발한다.\n" +
                    "4. 보안 관련 분야에서 영상인식시스템의 개발과 더불어 CCTV와의 연계를 추구하는 소프트웨어를 개발하기도 한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 정보처리기사, 정보통신기사, 전파통신기사, 방송통신기사, 전파전자기사"),

        OccupationText("디지털음성처리전문가", "컴퓨터를 이용한 영상분석, 영상인식, 영상복원 및 영상통신 등에 관련된 시스템을 개발한다.",
            "수행직무: \n" +
                    "1. 디지털영상에 관한 신기술동향을 파악하고 연구한다.\n" +
                    "2. 카메라, 스캐너, 인터넷 등에서 디지털이미지를 획득한다.\n" +
                    "3. 여러가지로 분리되어 있는 영상을 목적에 맞게 개선하는 영상조작, 글자, 그림, 영상 등을 분석하는 영상분석, 물체를 모습 그대로 인식하는 영상인식, 손상된 영상을 복구하는 영상복원, 영상을 저장하거나 압축하여 위성이나 케이블, 네트워크 등으로 전송하는 영상통신에 관련된 시스템을 개발한다.\n" +
                    "4. 보안 관련 분야에서 영상인식시스템의 개발과 더불어 CCTV와의 연계를 추구하는 소프트웨어를 개발하기도 한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: 정보처리기사, 정보통신기사, 전파통신기사, 방송통신기사, 전파전자기사"),

        OccupationText("멀티미디어분석가", "고객미팅을 통해 고객요구사항 및 일정 등을 검토하고 제작계획을 수립한다.",
            "수행직무: \n" +
                    "1. 멀티미디어 제작에 사용될 그래픽, 영상, 음향 등의 모듈제작에 참여하거나 통합하고 전체 테스트를 실시한다.\n" +
                    "2. 고객중심적 사고, 자료수집 및 분석, 개념화과정 등을 통해 창의적 개념을 추출한다.\n" +
                    "3. 고객사업의 특성 및 요구에 맞는 적절한 매체를 결정하고 표준안 및 시안을 제작하고 생산물의 품질을 점검·보완한다.\n" +
                    "4. 작업에 필요한 영상, 음향, 이벤트 등의 외주업체 수준 및 단가 등을 검토하여 추천안을 제시한다.\n" +
                    "5. 외주 업체와의 공동작업에 참여하거나 조정한다.\n" +
                    "6. 검토모임에 참가하고 제기된 문제점에 대한 개선안을 제시하거나 조정·통합한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("IT교육강사", "컴퓨터 관련 전문인력을 양성하기 위해 수강생들에게 컴퓨터 관련 하드웨어, 소프트웨어, 언어, 운영체계, 네트워크, 데이터베이스, 인터넷, 홈페이지 제작 등과 같은 과목 및 기술을 교육한다.",
            "수행직무: \n" +
                    "1. 교육 목적에 부합되는 훈련프로그램이나 수업과정을 개발한다.\n" +
                    "2. 강의시간에 수강생들을 가르친다.\n" +
                    "3. 수강생이 강의 중 혹은 이외의 학습과정에서 궁금했던 사항에 대한 질문에 응답한다.\n" +
                    "4. 수강생들이 강의시간 이외에 실습하기 위해 참고할 책의 목록을 만든다.\n" +
                    "5. 수강생들의 수업내용 숙지 정도를 평가하기 위해 시험을 실시하고, 채점한다.\n" +
                    "6. 수강생들에게 컴퓨터 혹은 향후 직업선택과 관련한 조언을 한다.\n" +
                    "7. 출석부 관리와 같은 행정업무를 수행한다.\n" +
                    "8. 다양한 자료원을 통해 최신 정보를 획득한다.\n" +
                    "9. 자신의 강의 분야의 새로운 지식이나 전문기술의 동향을 파악한다.", "연봉: 4000만원 이상",
            "일자리전망: 좋음", "발전가능성: 보통 이상", "고용평등: 보통 이상",
            "관련자격증: X"),

        OccupationText("IT기술지원전문가", "기술지원전문가는 시스템 사용상의 고장이나 문제가 발생했을 때 이를 원활히 해결해주고 기술적인 지원을 제공한다.",
            "수행직무: \n" +
                    "1. IT기술지원전문가는 설치지시서에 따라 컴퓨터에 소프트웨어를 설치하거나 하드웨어의 가벼운 고장을 수리한다.\n" +
                    "2. 새로운 시스템을 구성하거나 시스템 변경에 필요한 것을 결정하기 위하여 사용자와 관리자, 간부 등과 협의한다.\n" +
                    "3. 매뉴얼을 읽고 사용자와 협의하며 컴퓨터에 나타난 문제를 진단하고 전문적인 기술지원을 해준다.\n" +
                    "4. 사용자가 상품을 사용하는 데 불편이 없는지를 평가하기 위해 소프트웨어, 하드웨어, 주변장치 등을 검사하고 모니터링한다.\n" +
                    "5. 소프트웨어나 하드웨어를 평가한 보고서를 준비하여 관리자가 참고할 수 있는 제언을 한다.\n" +
                    "6. 일상적인 데이터 전송기록과 문제 유무를 살펴 문제가 있을 경우에 이를 어떻게 처리했으며, 소프트웨어를 어떻게 설치했는지에 대한 기록을 남긴다.\n" +
                    "7. 하드웨어나 소프트웨어에 관한 지식을 최신화하기 위해 전문잡지나 매뉴얼을 읽고, 회의나 세미나에 참석한다.\n" +
                    "8. 문제해결을 수행하는 작업자, 모니터링 담당자, 자료 전송장비와 소프트웨어를 다루는 사람 등과 협조하거나 이들에게 지시한다.\n" +
                    "9. 사용자에게 전달할 서류를 준비하거나 장비를 조사한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 네트워크관리사1급, 네트워크관리사2급, 빅데이터분석기사"),

        OccupationText("IT컨설턴트", "기업의 인적, 물적 자원 및 모든 조건에 관련된 자료를 수집·분석하고, 최근의 기술적 활용 자원과 현재 상태의 정보를 고려해 시스템을 구축하고 조언하거나 자문한다.",
            "수행직무: \n" +
                    "1. IT컨설턴트는 기업의 인적, 물적 자원 및 모든 조건에 관련된 자료를 수집·분석하고, 최근의 기술적 활용 자원과 현재 상태의 정보를 고려해 시스템을 구축하고 조언하거나 자문한다.\n" +
                    "2. 구축된 정보시스템을 통해 경영상의 개선효과, 시스템의 효율성 등에 대해 사후 모니터를 실시하며 시스템의 운용과 유지보수에 관한 조언을 한다.\n" +
                    "3. 프로젝트 전반을 관리하며 구축시스템의 적합성과 안정성 등을 감리하고 프로그래머와 고객요구사항을 조율한다.\n" +
                    "4. 기업이 업무 효율성과 생산성을 높이는 정보시스템을 갖추고 운영할 수 있도록 제반사항을 컨설팅 한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 정보처리기능사, 정보관리기술사, 정보통신산업기사, 컴퓨터시스템응용기술사, 정보보안기사"),

        OccupationText("IT프로젝트매니저", "IT 프로젝트 목표를 성공적으로 달성하기 위하여 프로젝트를 기획하고 인적자원관리, 일정관리, 원가관리, 리스크관리, 품질관리 등의 프로젝트 이행을 관리·감독·통제한다.",
            "수행직무: \n" +
                    "1. 신규 프로젝트를 착수하기 위하여 프로젝트 환경분석, 타당성조사 및 비즈니스케이스 개발을 수행하고 프로젝트 성공에 필요한 기준을 수립한다.\n" +
                    "2. 다양한 프로젝트관리활동들을 식별, 정의, 통합 및 조정하여 이해관계자의 요구사항과 기대치를 파악하고 관리한다.\n" +
                    "3. 이해관계자를 식별하고, 효율적인 참여유도를 위한 관리전략을 개발한다.\n" +
                    "4. 요구와 기대사항을 이해하기 위해 지속적으로 의사소통을 유지하여 발생된 이슈를 처리하고 이해관계자를 효율적으로 관리한다.\n" +
                    "5. 프로젝트에 포함할 사항과 제외할 작업을 정의하고 통제한다.\n" +
                    "6. 프로젝트 수행을 위해 필요한 인적자원을 효과적이고 효율적인 프로세스를 통해 통제하고 관리한다.\n" +
                    "7. 단위활동들의 순서를 정하고 각 활동의 수행에 필요한 자원을 할당한다.\n" +
                    "8. 소요시간을 산출하여 프로젝트 전체일정을 수립하고 이를 주기적으로 평가, 조정 및 관리한다.\n" +
                    "9. 승인된 예산범위에서 프로젝트를 완료할 수 있도록 원가산정, 예산수립, 필요자금 조성 및 집행을 통해 진도상황을 모니터링하고 원가를 통제한다.\n" +
                    "10. 프로젝트 목표에 영향을 미칠 수 있는 리스크를 식별·평가·대응하고 통제한다.\n" +
                    "11. 프로젝트의 요구사항을 충족하기 위한 품질정책, 품질목표, 품질책임사항을 결정하고, 이를 준수할 수 있는 품질보증 및 통제를 계획하고 확립하는 데 요구되는 프로세스를 관리하고 수행한다.\n" +
                    "12. 프로젝트 수행조직이 품질윤리를 실천할 수 있도록 지휘하고 통제한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 보통 이상",
            "관련자격증: X"),

        OccupationText("국가사이버안전요원", "국내 주요 전산망의 위협요인을 사전에 차단하고, 예방하는 업무를 수행한다.",
            "수행직무: \n" +
                    "1. 국가기관, 산업체, 연구소 등 주요 전산망의 안전성 여부를 확인하여 사이버 공격징후를 탐지한다.\n" +
                    "2. 위험요소가 포착될 경우 각 기관에 알려 사이버테러를 예방할 수 있도록 조치한다. 사이버공격에 대한 진원지 및 의도를 파악하고, 재발방지를 위한 보안기술을 지원한다.\n" +
                    "3. 보안취약점을 발굴하고 해킹취약성을 진단하여 보안책을 지원한다. 사이버테러 발생 시 현장 또는 원격으로 사고원인을 분석하고 복구한다.\n" +
                    "4. 사이버 보안교육, 모의훈련 등을 실시한다.\n" +
                    "5. 사이버위협 정보분석, 보안기술연구, 국내외 사이버위협 동향, 보안취약성 분석 등의 업무를 수행한다.\n" +
                    "6. 사이버테러 발생 시 유관기관과 합동으로 복구작업을 한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 좋음", "고용평등: 보통 이상",
            "관련자격증: 정보보안기사"),

        OccupationText("모바일프로그래머", "모바일기기에서 사용되는 프로그램을 개발하고 유지보수한다.",
            "수행직무: \n" +
                    "1. PDA, 스마트폰 등 모바일기기들에서 사용되는 프로그램을 개발한다.\n" +
                    "2. Palm, Windows, iOS, Android, Bada, Symbian 등 사용되어질 모바일 운영체제에 맞는 개발툴을 사용한다.\n" +
                    "3. 소규모 개발의 경우 기획, 설계, 개발, 테스트 및 유지보수작업 등을 담당한다.\n" +
                    "4. 회사 또는 개인의 의뢰를 받아 개발하기도 하며, 모바일마켓에 등록하여 판매하기도 한다.", "연봉: 3000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 정보처리기사"),

        OccupationText("블록체인개발자", "블록체인 원리, 개념 및 방법을 적용하여 금융, 결제, 운송 등 각종 정보시스템을 연구하고 개발한다.",
            "수행직무: \n" +
                    "1. 블록체인 기반 기술을 연구하고 관련 애플리케이션을 개발한다.\n" +
                    "2. 블록체인 플랫폼을 연구·개발한다.\n" +
                    "3. API 및 인터페이스를 개발한다.\n" +
                    "4. 네트워크 내의 노드들의 상호검증을 통해 블록생성을 이끌어내는 프로세스와 알고리즘을 나타내는 컨센서스(합의) 엔진을 개발하고 연구한다.\n" +
                    "5. 블록체인 기반의 기술지원 및 프로젝트를 수행한다.\n" +
                    "6. 블록체인 기반의 다양한 정보시스템을 개발한다.", "연봉: 3000만원 이상",
            "일자리전망: 좋음", "발전가능성: 매우 좋음", "고용평등: 보통 이상",
            "관련자격증: X"),

        OccupationText("사이버포렌식전문가", "디지털, 사이버 증거자료를 확보하기 위하여 수집절차에 따라 시스템, 하드웨어, 모바일 등 증거대상자료를 수집, 확보하고 분석툴을 활용하여 자료를 복구하거나 분석하여 증거분석서를 작성한다.",
            "수행직무: \n" +
                    "1. 의료소송, 가사 및 행정소송, 기업정보유출사건 관계자로부터 의뢰내용을 사전에 파악한다. \n" +
                    "2. 현장에 나가서 시스템의 종류 등 증거 수집할 내용과 특성을 분석하여 자료를 수집하며 시간이 지나면 삭제되는 휘발성자료의 경우 무결성 등을 확보하기 위하여 조치를 취한다.\n" +
                    "3. 시스템 등 현장에서 분석이 필요한 경우 현장에서 분석한다.\n" +
                    "4. 수집한 증거물 또는 의뢰받은 증거물을 인증된 분석장비, 분석프로그램 등을 사용하여 절차에 따라 데이터, 파일을 복구하고 분석한다.\n" +
                    "5. 증거수집절차와 과정, 결과 등을 제시한 증거분석서를 작성한다.\n" +
                    "6. 정보보안측면에서 침해사고가 발생했을 때 침투흔적분석, 경로추적, 흔적분석을 한다.\n" +
                    "7. 영업비밀유출 등 디지털포렌식 범죄와 관련하여 사전예방조치 등에 대해 컨설팅하거나 임직원을 대상으로 사전예방조치를 위한 교육을 한다.\n" +
                    "8. 필요시 법정에 출두하여 증언하기도 한다. 경찰조사 시 입회하기도 한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 보통 이상", "고용평등: 보통 이상",
            "관련자격증: 디지털포렌식전문가 1급, 2급"),

        OccupationText("사물인터넷개발자", "사물에 센서와 통신기능을 내장해 사물끼리 인터넷을 통해 실시간으로 데이터를 주고받는 기술이나 환경을 개발한다.",
            "수행직무: \n" +
                    "1. 센서와 스마트기기를 결합하여 개인에게 필요한 용도로 사용할 수 있도록 개발한다. \n" +
                    "2. USB, 블루투스, Wifi, NFC(Near Field Communication:근거리 통신망) 등의 네트워크를 활용하여 센서와 사물인터넷의 서비스 인터페이스 기술을 개발한다.\n" +
                    "3. 체중, 혈당, 혈압 등 환자와 관련된 생체정보를 유무선통신을 통해 스마트폰으로 전송할 수 있도록 하는 애플리케이션 등을 개발한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: X"),

        OccupationText("시스템운영관리자", "시스템운영관리자는 기업체나 기관에 설치되어 있는 컴퓨터 정보 시스템을 안전하고 체계적으로 운영관리하고 사용자들에게 각종 서비스를 제공한다.",
            "수행직무: \n" +
                    "1. 시스템운영관리자는 기업체나 기관에 설치되어 있는 컴퓨터 정보 시스템을 안전하고 체계적으로 운영관리하고 사용자들에게 각종 서비스를 제공한다.\n" +
                    "2. 시스템 장비는 외부환경에 영향을 받기 쉬우므로 전산실 내의 온도, 습도, 분진 등을 체크하고 적정수준을 유지할 수 있도록 한다.\n" +
                    "3. 정보시스템의 사용자에 대한 등록관리와 사용권한을 부여하여, 시스템 내의 정보를 외부로부터 보호하기 위해 기술적 장치를 마련하고 정기적으로 데이터를 백업한다.\n" +
                    "4. 시스템 운영상의 문제점이나 고장이 발생하면, 즉시 원인을 파악하여 시스템을 최단시간 내에 복구한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 보통 미만",
            "관련자격증: 정보처리기능사, 정보관리기술사, 전자계산기조직응용기사"),

        OccupationText("전자공학기술자", "전자공학기술자는 전산기 하드웨어 및 계측제어 설비의 사양을 검토·조정하고, 전자제품을 개발설계하고 생산관리 및 감독하는 일을 담당한다.",
            "수행직무: \n" +
                    "1. 전자공학기술자는 물리학 및 수학의 이론과 원리를 바탕으로 재료 속성에 대한 지식을 활용하여 전자제품을 개발설계하고 생산관리 및 감독업무를 한다.\n" +
                    "2. 제품을 설계개발하기 위해서는 시장조사를 거쳐 소비자가 원하는 성능, 기능, 디자인 등의 의견수렴을 하고 경쟁업체 제품 및 세계 트렌드, 기술변화 등을 분석한 후 디자인 설계를 한다.\n" +
                    "3. 계획된 공사의 설계와 시공감독 및 조언을 담당하고 계측제어설비에 대한 정비계획을 수립·시행한다.\n" +
                    "4. 전산기 하드웨어 및 계측제어 설비의 사양을 검토·조정하고 신기술 도입 및 개발 방안을 연구한다.\n" +
                    "5. 제품의 모델을 만들어 성능에 이상은 없는지, 제대로 작동은 하는지, 진동이나 충격에 강한지 등을 테스트 한다.\n" +
                    "6. 기존의 생산시스템으로 제작이 가능한지를 점검하고 불량품이 발생하지 않도록 한다.", "연봉: 4000만원 이상",
            "일자리전망: 매우 좋음", "발전가능성: 매우 좋음", "고용평등: 좋음",
            "관련자격증: 전자기기기능사, 전자기사, 전자산업기사, 전자기기기능장")


    )
}
